Configuration/InformationRegisters/НастройкиОбученияРазвития.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбученияРазвития</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьОбучениеРазвитиеСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПубликацииМероприятийОбученияРазвития</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьУченическиеДоговоры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЦелиРазвитияСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПрогрессОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродолжительностьПрогрессаОбучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерностьПродолжительностиПрогрессаОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/InformationRegisters/НастройкиОбученияРазвития/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	РазделыДанных = Новый Массив;
	РазделыДанных.Добавить("УправленческиеДанные");
	РазделыДанных.Добавить("ПодборПерсонала");
	
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки, РазделыДанных);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы


// Процедура выполняет начальное заполнение данных настройки прогресса обучения
//
// Параметры:
//  ПараметрыОбновления  - Структура - описывает текущие параметры обновления
//
Процедура ПриНачальномЗаполненииДанныхПрогрессаОбучения(ПараметрыОбновления) Экспорт
	
	НастройкиОбученияРазвития = ЗначенияНастроек();
	Если ЗначениеЗаполнено(НастройкиОбученияРазвития.ПродолжительностьПрогрессаОбучения) Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкиОбученияРазвития");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		НастройкиОбученияРазвития.ПродолжительностьПрогрессаОбучения = 4;
		НастройкиОбученияРазвития.РазмерностьПродолжительностиПрогрессаОбучения = Перечисления.Периодичность.Квартал;
		УстановитьНастройки(НастройкиОбученияРазвития);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьНастройкуИспользоватьПубликацииМероприятийОбученияРазвития(ИспользоватьСамообслуживаниеСотрудников) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 
		Или Не НаборЗаписей[0].ИспользоватьОбучениеРазвитиеСотрудников
		Или НаборЗаписей[0].ИспользоватьПубликацииМероприятийОбученияРазвития = ИспользоватьСамообслуживаниеСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ИспользоватьПубликацииМероприятийОбученияРазвития", ИспользоватьСамообслуживаниеСотрудников);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ЗначенияНастроек() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(НастройкиОбученияРазвития.ИспользоватьОбучениеРазвитиеСотрудников, ЛОЖЬ) КАК ИспользоватьОбучениеРазвитиеСотрудников,
		|	ЕСТЬNULL(НастройкиОбученияРазвития.ИспользоватьПубликацииМероприятийОбученияРазвития, ЛОЖЬ) КАК ИспользоватьПубликацииМероприятийОбученияРазвития,
		|	ЕСТЬNULL(НастройкиОбученияРазвития.ИспользоватьУченическиеДоговоры, ЛОЖЬ) КАК ИспользоватьУченическиеДоговоры,
		|	ЕСТЬNULL(НастройкиОбученияРазвития.ИспользоватьЦелиРазвитияСотрудников, ЛОЖЬ) КАК ИспользоватьЦелиРазвитияСотрудников,
		|	ЕСТЬNULL(НастройкиОбученияРазвития.ИспользоватьПрогрессОбучения, ЛОЖЬ) КАК ИспользоватьПрогрессОбучения,
		|	ЕСТЬNULL(НастройкиОбученияРазвития.ПродолжительностьПрогрессаОбучения, 0) КАК ПродолжительностьПрогрессаОбучения,
		|	ЕСТЬNULL(НастройкиОбученияРазвития.РазмерностьПродолжительностиПрогрессаОбучения, НЕОПРЕДЕЛЕНО) КАК РазмерностьПродолжительностиПрогрессаОбучения
		|ИЗ
		|	РегистрСведений.НастройкиОбученияРазвития КАК НастройкиОбученияРазвития";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СоздатьМенеджерЗаписи();
	Иначе
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
КонецФункции

Процедура УстановитьНастройки(НастройкиОбученияРазвития) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		НаборЗаписей.Добавить();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НаборЗаписей[0], НастройкиОбученияРазвития);
	Если ОбновлениеИнформационнойБазы.ЭтоВызовИзОбработчикаОбновления() Тогда
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	Иначе
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
